Revit 2024 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCannotCreateCustomConnection Property
 Could not create a custom connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralCannotCreateCustomConnection { get; }
Visual Basic
Public Shared ReadOnly Property StructuralCannotCreateCustomConnection As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralCannotCreateCustomConnection {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace